Revit 2027 API
BuiltInFailures.ElectricityFailures.InvalidPoleNumber Property
 The panel is single phase [wire] wires. The number of poles can not be larger than [value].
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidPoleNumber { get; }
Public Shared ReadOnly Property InvalidPoleNumber As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidPoleNumber {
	FailureDefinitionId^ get ();
}
static member InvalidPoleNumber : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ElectricityFailures Class
Autodesk.Revit.DB Namespace